from django.shortcuts import render, redirect
from django.http import HttpResponse
import pandas as pd
from .forms import UploadFileForm

# Create your views here.

def balance_sheet_view(request):
    data = [
        {"name": "Краткосрочные активы", "code": "01", "march": "0", "december": "0"},
        {"name": "Денежные средства и эквиваленты денежных средств", "code": "02", "march": "", "december": ""},
        {"name": "Краткосрочные финансовые инвестиции", "code": "03", "march": "", "december": ""},
        {"name": "Краткосрочная дебиторская задолженность", "code": "04", "march": "", "december": ""},
        {"name": "Запасы", "code": "05", "march": "", "december": ""},
        {"name": "Текущие налоговые активы", "code": "06", "march": "", "december": ""},
        {"name": "Долгосрочные активы, предназначенные для продажи", "code": "07", "march": "", "december": ""},
        {"name": "Биологические активы", "code": "08", "march": "", "december": ""},
        {"name": "Прочие краткосрочные активы", "code": "09", "march": "", "december": ""},
        {"name": "Долгосрочные активы", "code": "10", "march": "0", "december": "0"},
        {"name": "Долгосрочные финансовые инвестиции", "code": "11", "march": "", "december": ""},
        {"name": "Долгосрочная дебиторская задолженность", "code": "12", "march": "", "december": ""},
        {"name": "Инвестиции в совместно контролируемые предприятия", "code": "13", "march": "", "december": ""},
        {"name": "Инвестиции в недвижимость", "code": "14", "march": "", "december": ""},
        {"name": "Основные средства", "code": "15", "march": "", "december": ""},
        {"name": "Биологические активы", "code": "16", "march": "", "december": ""},
        {"name": "Разведочные и оценочные активы", "code": "17", "march": "", "december": ""},
        {"name": "Нематериальные активы", "code": "18", "march": "", "december": ""},
        {"name": "Отложенные налоговые активы", "code": "19", "march": "", "december": ""},
        {"name": "Прочие долгосрочные активы", "code": "20", "march": "", "december": ""},
        {"name": "БАЛАНС (строка 01 + строка 10)", "code": "21", "march": "0", "december": "0"},
        {"name": "Обязательства", "code": "22", "march": "0", "december": "0"},
        {"name": "Краткосрочные обязательства", "code": "23", "march": "0", "december": "0"},
        {"name": "Краткосрочные финансовые обязательства", "code": "24", "march": "", "december": ""},
        {"name": "Обязательства по налогам", "code": "25", "march": "", "december": ""},
        {"name": "Обязательства по другим обязательным и добровольным платежам", "code": "26", "march": "", "december": ""},
        {"name": "Краткосрочная кредиторская задолженность", "code": "27", "march": "", "december": ""},
        {"name": "Краткосрочные оценочные обязательства", "code": "28", "march": "", "december": ""},
        {"name": "Прочие краткосрочные обязательства", "code": "29", "march": "", "december": ""},
        {"name": "Долгосрочные обязательства", "code": "30", "march": "0", "december": "0"},
        {"name": "Долгосрочные финансовые обязательства", "code": "31", "march": "", "december": ""},
        {"name": "Долгосрочная кредиторская задолженность", "code": "32", "march": "", "december": ""},
        {"name": "Долгосрочные оценочные обязательства", "code": "33", "march": "", "december": ""},
        {"name": "Отложенные налоговые обязательства", "code": "34", "march": "", "december": ""},
        {"name": "Прочие долгосрочные обязательства", "code": "35", "march": "", "december": ""},
        {"name": "Капитал", "code": "36", "march": "0", "december": "0"},
        {"name": "Уставный капитал", "code": "37", "march": "", "december": ""},
        {"name": "Неоплаченный капитал", "code": "38", "march": "", "december": ""},
        {"name": "Выкупленные собственные долевые инструменты", "code": "39", "march": "", "december": ""},
        {"name": "Эмиссионный доход", "code": "40", "march": "", "december": ""},
        {"name": "Дополнительно оплаченный капитал", "code": "41", "march": "", "december": ""},
        {"name": "Резервы", "code": "42", "march": "", "december": ""},
        {"name": "Нераспределенная прибыль (непокрытый убыток)", "code": "43", "march": "", "december": ""},
        {"name": "Итоговая прибыль (итоговый убыток)", "code": "44", "march": "", "december": ""},
        {"name": "БАЛАНС (строка 22 + строка 36)", "code": "45", "march": "0", "december": "0"},
    ]

    if request.method == 'POST':
        form = UploadFileForm(request.POST, request.FILES)
        if form.is_valid():
            excel_file = request.FILES['file']
            df = pd.read_excel(excel_file)

            # Выполнить вычисления для "Краткосрочные активы"
            short_term_assets_present = (
                df.loc[df['Счет'] == 1000, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1100, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1200, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1300, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1400, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1700, 'Сальдо на конец (Дебет)'].sum()
            )
            short_term_assets_past = (
                df.loc[df['Счет'] == 1000, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1100, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1200, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1300, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1400, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1700, 'Сальдо на начало (Дебет)'].sum()
            )
            
            # Выполнить вычисления для "Денежные средства и эквиваленты денежных средств"
            cash_present = (
                df.loc[df['Счет'] == 1010, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1020, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1030, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1040, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1050, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1060, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1070, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1080, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1090, 'Сальдо на конец (Кредит)'].sum()
            )           
            cash_past = (
                df.loc[df['Счет'] == 1010, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1020, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1030, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1040, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1050, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1060, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1070, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1080, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1090, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Краткосрочные финансовые инвестиции
            stfininv_present = (
                df.loc[df['Счет'] == 1110, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1120, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1130, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1140, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1150, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1160, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1070, 'Сальдо на конец (Кредит)'].sum()
            )       
            stfininv_past = (
                df.loc[df['Счет'] == 1110, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1120, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1130, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1140, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1150, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1160, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1070, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Краткосрочная дебиторская задолженность
            st_acc_rec_present = (
                df.loc[df['Счет'] == 1210, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1220, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1230, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1240, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1250, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1260, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1270, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1280, 'Сальдо на конец (Кредит)'].sum()
            )    
            st_acc_rec_past = (
                df.loc[df['Счет'] == 1210, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1220, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1230, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1240, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1250, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1260, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1270, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1280, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Запасы
            stocks_present = (
                df.loc[df['Счет'] == 1310, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1320, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1330, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1340, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1350, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1370, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1360, 'Сальдо на конец (Кредит)'].sum()
            )    
            stocks_past = (
                df.loc[df['Счет'] == 1310, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1320, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1330, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1340, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1350, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1370, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1360, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Текущие налоговые активы
            current_tax_assets_present = (
                df.loc[df['Счет'] == 1410, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1420, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1430, 'Сальдо на конец (Дебет)'].sum()
            )
            current_tax_assets_past = (
                df.loc[df['Счет'] == 1410, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1420, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1430, 'Сальдо на начало (Дебет)'].sum()
            )

            # Выполнить вычисления для Долгосрочные активы, предназначенные для продажи
            non_current_assets_held_for_sale_present = (
                df.loc[df['Счет'] == 1510, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1520, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1530, 'Сальдо на конец (Кредит)'].sum()
            )
            non_current_assets_held_for_sale_past = (
                df.loc[df['Счет'] == 1510, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1520, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1530, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Биологические активы
            biological_assets_present = (
                df.loc[df['Счет'] == 1610, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1620, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1630, 'Сальдо на конец (Кредит)'].sum()
            )
            biological_assets_past = (
                df.loc[df['Счет'] == 1610, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1620, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1630, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Прочие краткосрочные активы
            other_short_term_assets_present = (
                df.loc[df['Счет'] == 1710, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1720, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1730, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1750, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 1740, 'Сальдо на конец (Кредит)'].sum()
            )           
            other_short_term_assets_past = (
                df.loc[df['Счет'] == 1710, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1720, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1730, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1750, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 1740, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Долгосрочные активы
            long_term_assets_present = (
                df.loc[df['Счет'] == 2000, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2100, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2200, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2300, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2400, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2500, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2600, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2700, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2800, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2900, 'Сальдо на конец (Дебет)'].sum()
            )
            long_term_assets_past = (
                df.loc[df['Счет'] == 2000, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2100, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2200, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2300, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2400, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2500, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2600, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2700, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2800, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2900, 'Сальдо на начало (Дебет)'].sum()
            )

            # Выполнить вычисления для Долгосрочные финансовые инвестиции
            long_term_financial_investments_present = (
                df.loc[df['Счет'] == 2010, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2020, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2030, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2040, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2050, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2060, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2070, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2080, 'Сальдо на конец (Кредит)'].sum()
            )
            long_term_financial_investments_past = (
                df.loc[df['Счет'] == 2010, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2020, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2030, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2040, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2050, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2060, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2070, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2080, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Долгосрочная дебиторская задолженность
            long_term_accounts_receivable_present = (
                df.loc[df['Счет'] == 2110, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2120, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2130, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2140, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2150, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2160, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2170, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2180, 'Сальдо на конец (Кредит)'].sum()
            )           
            long_term_accounts_receivable_past = (
                df.loc[df['Счет'] == 2110, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2120, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2130, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2140, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2150, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2160, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2170, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2180, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Инвестиции в совместно контролируемые предприятия 
            investments_in_jointly_controlled_enterprises_present = (
                df.loc[df['Счет'] == 2210, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2220, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2230, 'Сальдо на конец (Кредит)'].sum()
            )
            investments_in_jointly_controlled_enterprises_past = (
                df.loc[df['Счет'] == 2210, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2220, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2230, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Инвестиции в недвижимость
            estate_investment_present = (
                df.loc[df['Счет'] == 2310, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2320, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2330, 'Сальдо на конец (Кредит)'].sum()
            )
            estate_investment_past = (
                df.loc[df['Счет'] == 2310, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2320, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2330, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Основные средства 
            fixed_assets_present = (
                df.loc[df['Счет'] == 2410, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2440, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2420, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2430, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2450, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2460, 'Сальдо на конец (Кредит)'].sum()
            )
            fixed_assets_past = (
                df.loc[df['Счет'] == 2410, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2440, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2420, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2430, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2450, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2460, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Биологические активы (долгосрочные)
            long_term_biological_assets_present = (
                df.loc[df['Счет'] == 2510, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2520, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2530, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2540, 'Сальдо на конец (Кредит)'].sum()
            )
            long_term_biological_assets_past = (
                df.loc[df['Счет'] == 2410, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2430, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2450, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2460, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Разведочные и оценочные активы
            exploration_and_appraisal_assets_present = (
                df.loc[df['Счет'] == 2610, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2620, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2630, 'Сальдо на конец (Кредит)'].sum()
            )        
            exploration_and_appraisal_assets_past = (
                df.loc[df['Счет'] == 2610, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2620, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2630, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Нематериальные активы
            intangible_assets_present = (
                df.loc[df['Счет'] == 2710, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2720, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2730, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2760, 'Сальдо на конец (Дебет)'].sum() -
                df.loc[df['Счет'] == 2740, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2750, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2770, 'Сальдо на конец (Кредит)'].sum() -
                df.loc[df['Счет'] == 2780, 'Сальдо на конец (Кредит)'].sum()
            )           
            intangible_assets_past = (
                df.loc[df['Счет'] == 2710, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2720, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2730, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2760, 'Сальдо на начало (Дебет)'].sum() -
                df.loc[df['Счет'] == 2740, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2750, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2770, 'Сальдо на начало (Кредит)'].sum() -
                df.loc[df['Счет'] == 2780, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления для Отложенные налоговые активы
            deferred_tax_assets_present = (
                df.loc[df['Счет'] == 2810, 'Сальдо на конец (Дебет)'].sum()
            )
            deferred_tax_assets_past = (
                df.loc[df['Счет'] == 2810, 'Сальдо на начало (Дебет)'].sum()
            )

            # Выполнить вычисления для Прочие долгосрочные активы
            other_long_term_assets_present = (
                df.loc[df['Счет'] == 2910, 'Сальдо на конец (Дебет)'].sum()+
                df.loc[df['Счет'] == 2920, 'Сальдо на конец (Дебет)'].sum()+
                df.loc[df['Счет'] == 2930, 'Сальдо на конец (Дебет)'].sum()+
                df.loc[df['Счет'] == 2940, 'Сальдо на конец (Дебет)'].sum()+
                df.loc[df['Счет'] == 2960, 'Сальдо на конец (Дебет)'].sum()+
                df.loc[df['Счет'] == 2990, 'Сальдо на конец (Дебет)'].sum()-
                df.loc[df['Счет'] == 2950, 'Сальдо на конец (Кредит)'].sum()-
                df.loc[df['Счет'] == 2970, 'Сальдо на конец (Кредит)'].sum()-
                df.loc[df['Счет'] == 2980, 'Сальдо на конец (Кредит)'].sum()
            )
            other_long_term_assets_past = (
                df.loc[df['Счет'] == 2910, 'Сальдо на начало (Дебет)'].sum()+
                df.loc[df['Счет'] == 2920, 'Сальдо на начало (Дебет)'].sum()+
                df.loc[df['Счет'] == 2930, 'Сальдо на начало (Дебет)'].sum()+
                df.loc[df['Счет'] == 2940, 'Сальдо на начало (Дебет)'].sum()+
                df.loc[df['Счет'] == 2960, 'Сальдо на начало (Дебет)'].sum()+
                df.loc[df['Счет'] == 2990, 'Сальдо на начало (Дебет)'].sum()-
                df.loc[df['Счет'] == 2950, 'Сальдо на начало (Кредит)'].sum()-
                df.loc[df['Счет'] == 2970, 'Сальдо на начало (Кредит)'].sum()-
                df.loc[df['Счет'] == 2980, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления БАЛАНС (строка 01 + строка 10)
            balance_line_01_to_10_present = (
                df.loc[df['Счет'] == 1000, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1100, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1200, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1300, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1400, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 1700, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2000, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2100, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2200, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2300, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2400, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2500, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2600, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2700, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2800, 'Сальдо на конец (Дебет)'].sum() +
                df.loc[df['Счет'] == 2900, 'Сальдо на конец (Дебет)'].sum()
            )

            balance_line_01_to_10_past = (
                df.loc[df['Счет'] == 1000, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1100, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1200, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1300, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1400, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 1700, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2000, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2100, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2200, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2300, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2400, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2500, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2600, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2700, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2800, 'Сальдо на начало (Дебет)'].sum() +
                df.loc[df['Счет'] == 2900, 'Сальдо на начало (Дебет)'].sum()
            )

            # Выполнить вычисления Обязательства 
            liabilities_present = (
                df.loc[df['Счет'] == 3000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на конец (Кредит)'].sum()
            )

            liabilities_past = (
                df.loc[df['Счет'] == 3000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Краткосрочные обязательства
            short_term_liabilities_present = (
                df.loc[df['Счет'] == 3000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на конец (Кредит)'].sum()
            )

            short_term_liabilities_past = (
                df.loc[df['Счет'] == 3000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Краткосрочные финансовые обязательства
            short_term_financial_liabilities_present  = (
                df.loc[df['Счет'] == 3010, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3020, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3030, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3040, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3050, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3060, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3070, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3080, 'Сальдо на конец (Кредит)'].sum()
            )

            short_term_financial_liabilities_past = (
                df.loc[df['Счет'] == 3010, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3020, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3030, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3040, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3050, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3060, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3070, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3080, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Обязательства по налогам
            tax_liabilities_present = (
                df.loc[df['Счет'] == 3110, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3120, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3130, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3140, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3150, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3160, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3170, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3180, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3190, 'Сальдо на конец (Кредит)'].sum()
            )

            tax_liabilities_past = (
                df.loc[df['Счет'] == 3110, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3120, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3130, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3140, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3150, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3160, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3170, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3180, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3190, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Обязательства по другим обязательным и добровольным платежам
            liabilities_for_other_mandatory_and_voluntary_payments_present = (
                df.loc[df['Счет'] == 3210, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3220, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3230, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3240, 'Сальдо на конец (Кредит)'].sum()
            )

            liabilities_for_other_mandatory_and_voluntary_payments_past = (
                df.loc[df['Счет'] == 3210, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3220, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3230, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3240, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Краткосрочная кредиторская задолженность
            short_term_accounts_payable_present = (
                df.loc[df['Счет'] == 3310, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3320, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3330, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3340, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3350, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3360, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3370, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3380, 'Сальдо на конец (Кредит)'].sum()
            )
  
            short_term_accounts_payable_past = (
                df.loc[df['Счет'] == 3310, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3320, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3330, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3340, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3350, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3360, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3370, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3380, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Краткосрочные оценочные обязательства
            short_term_estimated_liabilities_present = (
                df.loc[df['Счет'] == 3410, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3420, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3430, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3440, 'Сальдо на конец (Кредит)'].sum()
            )
            
            short_term_estimated_liabilities_past = (
                df.loc[df['Счет'] == 3410, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3420, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3430, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3440, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Прочие краткосрочные обязательства
            other_short_term_liabilities_present = (
                df.loc[df['Счет'] == 3510, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3520, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3530, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3540, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3550, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3560, 'Сальдо на конец (Кредит)'].sum()
            )
            
            other_short_term_liabilities_past = (
                df.loc[df['Счет'] == 3510, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3520, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3530, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3540, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3550, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3560, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Долгосрочные обязательства
            long_term_liabilities_present = (
                df.loc[df['Счет'] == 4000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на конец (Кредит)'].sum()
            )

            long_term_liabilities_past = (
                df.loc[df['Счет'] == 4000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Долгосрочные финансовые обязательства
            long_term_financial_liabilities_present = (
                df.loc[df['Счет'] == 4010, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4020, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4030, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4040, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4050, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4060, 'Сальдо на конец (Кредит)'].sum()
            )
            
            long_term_financial_liabilities_past = (
                df.loc[df['Счет'] == 4010, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4020, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4030, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4040, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4050, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4060, 'Сальдо на начало (Кредит)'].sum()
            )

            
            # Выполнить вычисления Долгосрочная кредиторская задолженность
            long_term_accounts_payable_present = (
                df.loc[df['Счет'] == 4110, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4120, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4130, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4140, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4150, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4160, 'Сальдо на конец (Кредит)'].sum()
            )
            
            long_term_accounts_payable_past = (
                df.loc[df['Счет'] == 4110, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4120, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4130, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4140, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4150, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4160, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Долгосрочные оценочные обязательства
            long_term_estimated_liabilities_present = (
                df.loc[df['Счет'] == 4210, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4220, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4230, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4240, 'Сальдо на конец (Кредит)'].sum()
            )
            
            long_term_estimated_liabilities_past = (
                df.loc[df['Счет'] == 4210, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4220, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4230, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4240, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Отложенные налоговые обязательства
            deferred_tax_liabilities_present = (
                df.loc[df['Счет'] == 4310, 'Сальдо на конец (Кредит)'].sum()
            )
            
            deferred_tax_liabilities_past = (
                df.loc[df['Счет'] == 4310, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Прочие долгосрочные обязательства
            other_long_term_liabilities_present = (
                df.loc[df['Счет'] == 4410, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4420, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4430, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4440, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4450, 'Сальдо на конец (Кредит)'].sum()
            )

            other_long_term_liabilities_past = (
                df.loc[df['Счет'] == 4410, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4420, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4430, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4440, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4450, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Капитал
            capital_present = (
                df.loc[df['Счет'] == 5000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5500, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5600, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5700, 'Сальдо на конец (Кредит)'].sum()
            )
            
            capital_past = (
                df.loc[df['Счет'] == 5000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5500, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5600, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5700, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Уставный капитал
            share_capital_present = (
                df.loc[df['Счет'] == 5010, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5020, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5030, 'Сальдо на конец (Кредит)'].sum()
            )
            
            share_capital_past = (
                df.loc[df['Счет'] == 5010, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5020, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5030, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Неоплаченный капитал
            unpaid_capital_present = (
                df.loc[df['Счет'] == 5100, 'Сальдо на конец (Кредит)'].sum()
            )
            unpaid_capital_past = (
                df.loc[df['Счет'] == 5100, 'Сальдо на начало (Кредит)'].sum()
            )
            
            # Выполнить вычисления Выкупленные собственные долевые инструменты
            repurchased_own_equity_instruments_present = (
                df.loc[df['Счет'] == 5200, 'Сальдо на конец (Кредит)'].sum()
            )
            repurchased_own_equity_instruments_past = (
                df.loc[df['Счет'] == 5200, 'Сальдо на начало (Кредит)'].sum()
            )
            
            # Выполнить вычисления Эмиссионный доход
            issue_income_present = (
                df.loc[df['Счет'] == 5300, 'Сальдо на конец (Кредит)'].sum()
            )
            issue_income_past = (
                df.loc[df['Счет'] == 5300, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Дополнительно оплаченный капитал
            additional_paid_in_capital_present = (
                df.loc[df['Счет'] == 5410, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5420, 'Сальдо на конец (Кредит)'].sum()
            )
            
            additional_paid_in_capital_past = (
                df.loc[df['Счет'] == 5410, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5420, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Резервы
            reserves_present = (
                df.loc[df['Счет'] == 5510, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5520, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5530, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5540, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5550, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5560, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5570, 'Сальдо на конец (Кредит)'].sum()
            )
            
            reserves_past = (
                df.loc[df['Счет'] == 5510, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5520, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5530, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5540, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5550, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5560, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5570, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Нераспределенная прибыль (непокрытый убыток)
            retained_earnings_uncovered_loss_present = (
                df.loc[df['Счет'] == 5610, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5620, 'Сальдо на конец (Кредит)'].sum()
            )
            
            retained_earnings_uncovered_loss_past = (
                df.loc[df['Счет'] == 5610, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5620, 'Сальдо на начало (Кредит)'].sum()
            )

            # Выполнить вычисления Итоговая прибыль (итоговый убыток)
            total_profit_total_loss_present = (
                df.loc[df['Счет'] == 5710, 'Сальдо на конец (Кредит)'].sum()
            )
            
            total_profit_total_loss_past = (
                df.loc[df['Счет'] == 5710, 'Сальдо на начало (Кредит)'].sum()
            )
            # Выполнить вычисления Итоговая прибыль (итоговый убыток)
            balance_present = (
                df.loc[df['Счет'] == 3000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5000, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5100, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5200, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5300, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5400, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5500, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5600, 'Сальдо на конец (Кредит)'].sum() +
                df.loc[df['Счет'] == 5700, 'Сальдо на конец (Кредит)'].sum()
            )
            
            balance_past = (
                df.loc[df['Счет'] == 3000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 3500, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 4400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5000, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5100, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5200, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5300, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5400, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5500, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5600, 'Сальдо на начало (Кредит)'].sum() +
                df.loc[df['Счет'] == 5700, 'Сальдо на начало (Кредит)'].sum()
            )

            #========================Обновить данные в шаблоне================================ 
            data[0]["march"] = short_term_assets_present
            data[0]["december"] = short_term_assets_past
            #=================================================================================
            data[1]["march"] = cash_present
            data[1]["december"] = cash_past
            #=================================================================================
            data[2]["march"] = stfininv_present
            data[2]["december"] = stfininv_past
            #=================================================================================
            data[3]["march"] = st_acc_rec_present
            data[3]["december"] = st_acc_rec_past
            #=================================================================================
            data[4]["march"] = stocks_present
            data[4]["december"] = stocks_past
            #=================================================================================
            data[5]["march"] = current_tax_assets_present
            data[5]["december"] = current_tax_assets_past
            #=================================================================================
            data[6]["march"] = non_current_assets_held_for_sale_present
            data[6]["december"] = non_current_assets_held_for_sale_past
            #=================================================================================
            data[7]["march"] = biological_assets_present
            data[7]["december"] = biological_assets_past
            #=================================================================================
            data[8]["march"] = other_short_term_assets_present
            data[8]["december"] = other_short_term_assets_past
            #=================================================================================
            data[9]["march"] = long_term_assets_present
            data[9]["december"] = long_term_assets_past
            #=================================================================================
            data[10]["march"] = long_term_financial_investments_present
            data[10]["december"] = long_term_financial_investments_past
            #=================================================================================
            data[11]["march"] = long_term_accounts_receivable_present
            data[11]["december"] = long_term_accounts_receivable_past
            #=================================================================================
            data[12]["march"] = investments_in_jointly_controlled_enterprises_present
            data[12]["december"] = investments_in_jointly_controlled_enterprises_past
            #=================================================================================
            data[13]["march"] = estate_investment_present
            data[13]["december"] = estate_investment_past
            #=================================================================================
            data[14]["march"] = fixed_assets_present
            data[14]["december"] = fixed_assets_past
            #=================================================================================
            data[15]["march"] = long_term_biological_assets_present
            data[15]["december"] = long_term_biological_assets_past
            #=================================================================================
            data[16]["march"] = exploration_and_appraisal_assets_present
            data[16]["december"] = exploration_and_appraisal_assets_past
            #=================================================================================
            data[17]["march"] = intangible_assets_present
            data[17]["december"] = intangible_assets_past
            #=================================================================================
            data[18]["march"] = deferred_tax_assets_present
            data[18]["december"] = deferred_tax_assets_past
            #=================================================================================
            data[19]["march"] = other_long_term_assets_present
            data[19]["december"] = other_long_term_assets_past
            #=================================================================================
            data[20]["march"] = balance_line_01_to_10_present
            data[20]["december"] = balance_line_01_to_10_past  
            #=================================================================================
            data[21]["march"] = liabilities_present
            data[21]["december"] = liabilities_past 
            #=================================================================================
            data[22]["march"] = short_term_liabilities_present
            data[22]["december"] = short_term_liabilities_past
            #=================================================================================
            data[23]["march"] = short_term_financial_liabilities_present
            data[23]["december"] = short_term_financial_liabilities_past
            #=================================================================================
            data[24]["march"] = tax_liabilities_present
            data[24]["december"] = tax_liabilities_past
            #=================================================================================
            data[25]["march"] = liabilities_for_other_mandatory_and_voluntary_payments_present
            data[25]["december"] = liabilities_for_other_mandatory_and_voluntary_payments_past
            #=================================================================================
            data[26]["march"] = short_term_accounts_payable_present
            data[26]["december"] = short_term_accounts_payable_past
            #=================================================================================
            data[27]["march"] = short_term_estimated_liabilities_present
            data[27]["december"] = short_term_estimated_liabilities_past
            #=================================================================================
            data[28]["march"] = other_short_term_liabilities_present
            data[28]["december"] = other_short_term_liabilities_past
            #=================================================================================
            data[29]["march"] = long_term_liabilities_present
            data[29]["december"] = long_term_liabilities_past
            #=================================================================================
            data[30]["march"] = long_term_financial_liabilities_present
            data[30]["december"] = long_term_financial_liabilities_past
            #=================================================================================
            data[31]["march"] = long_term_accounts_payable_present
            data[31]["december"] = long_term_accounts_payable_past
            #=================================================================================
            data[32]["march"] = long_term_estimated_liabilities_present 
            data[32]["december"] = long_term_estimated_liabilities_past
            #=================================================================================
            data[33]["march"] = deferred_tax_liabilities_present 
            data[33]["december"] = deferred_tax_liabilities_past
            #=================================================================================
            data[34]["march"] = other_long_term_liabilities_present 
            data[34]["december"] = other_long_term_liabilities_past
            #=================================================================================
            data[35]["march"] = capital_present 
            data[35]["december"] = capital_past
            #=================================================================================
            data[36]["march"] = share_capital_present
            data[36]["december"] = share_capital_past
            #=================================================================================
            data[37]["march"] = unpaid_capital_present
            data[37]["december"] = unpaid_capital_past
            #=================================================================================
            data[38]["march"] = repurchased_own_equity_instruments_present
            data[38]["december"] = repurchased_own_equity_instruments_past
            #=================================================================================
            data[39]["march"] = issue_income_present
            data[39]["december"] = issue_income_past
            #=================================================================================
            data[40]["march"] = additional_paid_in_capital_present
            data[40]["december"] = additional_paid_in_capital_past
            #=================================================================================
            data[41]["march"] = reserves_present
            data[41]["december"] = reserves_past
            #=================================================================================
            data[42]["march"] = retained_earnings_uncovered_loss_present
            data[42]["december"] = retained_earnings_uncovered_loss_past
            #=================================================================================
            data[43]["march"] = total_profit_total_loss_present
            data[43]["december"] = total_profit_total_loss_past
            #=================================================================================
            data[44]["march"] = balance_present
            data[44]["december"] = balance_past
            #=================================================================================
            
            return render(request, 'balance_sheet.html', {'data': data, 'form': form})
    else:
        form = UploadFileForm()
    
    return render(request, 'balance_sheet.html', {'data': data, 'form': form})

def upload_excel(request):
    if request.method == 'POST':
        form = UploadFileForm(request.POST, request.FILES)
        if form.is_valid():
            excel_file = request.FILES['file']
            df = pd.read_excel(excel_file)

            data = []
            for _, row in df.iterrows():
                data.append({
                    "name": row['Показатели'],
                    "code": row['Код строки'],
                    "march": row['На 31 декабря 2023'],
                    "december": row['На 31 декабря 2022'],
                })

            return render(request, 'balance_sheet.html', {'data': data})
    else:
        form = UploadFileForm()
    return render(request, 'balance_sheet.html', {'form': form})

